actividades/ClementeJesus/app/Controllers/ViajesController.php

SELECT *
FROM `viajes`
---
    public function index()
    {
        $model = model(ViajesModel::class);

        $data = [
            'viajes' => $model->findAll(),
            'title' => 'Viajes archive',
        ];

INSERT INTO `viajes` (`viaje`, `fecha`, `plazas`) VALUES ('Viaje pruebawqadasd', '2025-02-13', '56')
---
    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['viaje', 'fecha', 'plazas']);


        if (! $this->validateData($data, [
            'viaje' => 'required|max_length[255]|min_length[1]',
            'fecha' => 'required|max_length[255]|min_length[1]',
            'plazas' => 'required|max_length[255]|min_length[1]',
        ])) {

            return $this->new();
        }


        $post = $this->validator->getValidated();

        $model_vij = model(ViajesModel::class);

        $model_vij->save([
            'viaje' => $post['viaje'],
            'fecha' => $post['fecha'],
            'plazas' => $post['plazas'],

        ]);

SELECT *
FROM `viajes`
WHERE `id` = '10'
DELETE FROM `viajes`
WHERE `id` = '10'
---
    public function delete($id)
    {

        if ($id == null) {
            throw new PageNotFoundException('Cannot delete the item');
        }

        $model = model(ViajesModel::class);

        if ($model->where('id', $id)->find()) {
            $model->where('id', $id)->delete();

SELECT *
FROM `viajes`
WHERE `id` = '1'
SELECT *
FROM `viajes`
WHERE `id` = '1'
 LIMIT 1
---
    public function update($id)
    {
        helper('form');

        if ($id == null) {
            throw new PageNotFoundException('Cannot update the item');
        }

        $model = model(ViajesModel::class);

        if ($model->where('id', $id)->find()) {

            $data = [
                'viajes' => $model->where('id', $id)->first(),
                'title' => 'Update Item',

            ];

UPDATE `viajes` SET `viaje` = 'Viaje pruebas', `fecha` = '2025-12-24', `plazas` = '33'
WHERE `viajes`.`id` IN ('9')
---
    public function updateItem($id)
    {
        helper('form');


        $data_form = $this->request->getPost(['viaje', 'fecha', 'plazas']);


        if (! $this->validateData($data_form, [
            'viaje' => 'required|max_length[255]|min_length[1]',
            'fecha' => 'required|max_length[255]|min_length[1]',
            'plazas' => 'required|max_length[255]|min_length[1]',

        ])) {

            return $this->update($id);
        }


        $post = $this->validator->getValidated();

        $model = model(ViajesModel::class);

        $model->save([
            'id' => $id,
            'viaje' => $post['viaje'],
            'fecha' => $post['fecha'],
            'plazas' => $post['plazas'],
        ]);