actividades/clementeJesus/app/Models/EventosModel.php

    public function getEventos($id = false)
    {
        if ($id === false) {
            $sql = $this->select('eventos.*, ciudades.ciudad');
            $sql = $this->join('ciudades', 'eventos.id_ciudad=ciudades.id');
            $sql = $this->findAll();
            return $sql;
        }

        $sql = $this->select('eventos.*, ciudades.ciudad');
        $sql = $this->join('ciudades', 'eventos.id_ciudad=ciudades.id');
        $sql = $this->where(['eventos.id' => $id]);
        $sql = $this->first();
---
SELECT `eventos`.*, `ciudades`.`ciudad`
FROM `eventos`
JOIN `ciudades` ON `eventos`.`id_ciudad`=`ciudades`.`id`
SELECT `eventos`.*, `ciudades`.`ciudad`
FROM `eventos`
JOIN `ciudades` ON `eventos`.`id_ciudad`=`ciudades`.`id`
WHERE `eventos`.`id` = '1'
 LIMIT 1