pruebasActividad/app/Controllers/JuegosController.php

    public function index()
    {
        $model = model(JuegosModel::class);

        $data = [
            'juegos' => $model->findAll(),
            'title' => 'Juegos archive',
        ];
---
SELECT *
FROM `juegos`

    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['nombre']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'nombre' => 'required|max_length[255]|min_length[3]',
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model_cat = model(JuegosModel::class);

        $model_cat->save([
            'nombre' => $post['nombre'],

        ]);
---
INSERT INTO `juegos` (`nombre`) VALUES ('Fallout')

    public function update($id)
    {
        helper('form');

        if ($id == null) {
            throw new PageNotFoundException('Cannot update the item');
        }

        $model = model(JuegosModel::class);

        if ($model->where('id', $id)->find()) {

            $data = [
                'juegos' => $model->where('id', $id)->first(),
                'title' => 'Update Item',

            ];
---
SELECT *
FROM `juegos`
WHERE `id` = '7'
SELECT *
FROM `juegos`
WHERE `id` = '7'
 LIMIT 1