app/Controllers/CategoryController.php

SELECT *
FROM `category`
---
    public function index()
    {
        $model = model(CategoryModel::class);

        $data = [
            'categories' => $model->findAll(),
            'title' => 'Categoty archive',
        ];

INSERT INTO `category` (`category`) VALUES ('pruebasda')
---
    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['category']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'category' => 'required|max_length[255]|min_length[3]',
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model_cat = model(CategoryModel::class);

        $model_cat->save([
            'category' => $post['category'],

        ]);