app/Controllers/NewsController.php

SELECT *
FROM `category`
---
     public function newsBycategory($id)
    {
        $model = model(NewsModel::class);
        $model_categorias = model(CategoryModel::class);
        ///////////////////////////////////////////////////////

        // FORMA MARILUZ

        // $sql = $model->select('news.*,category.category');
        // $sql = $model->join('category','news.id_category=category.id');
        // $sql = $model->where('id_category', $id)->findAll();

        // $data = [
        //     'news_list' => $sql,
        //     'title'     => 'News archive',
        //     'categories_list' => $model_categorias->findAll(),
        // ];
        ////////////////////////////////////////////////////////////



        $data = [ // FORMA JOSELU
            'news_list' => $model->where('id_category', $id)->getNews(),
            'title'     => 'News archive',
            'categories_list' => $model_categorias->findAll(),