app/Controllers/News.php

    public function update($id)
    {
        helper('form');

        if ($id == null) {
            throw new PageNotFoundExcepction('Cannot update the item');
        }

        $model = model(NewsModel::class);

        if($model->where('id' ,$id)->find()){
            $data = [
                'news' => $model->where('id' ,$id)->first(),
                'title' => 'Update Item',
            ];
---
SELECT *
FROM `news`
WHERE `id` = '1'

    public function updateItem($id)
    {
        helper('form');

        $data_form = $this->request->getPost(['title', 'body']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data_form, [
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
        ])) {
            // The validation fails, so returns the form.
            return $this->update($id);
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);

        $model->save([
            'id' => $id,
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
        ]);
---
UPDATE `news` SET `title` = 'Elvis sighteds', `slug` = 'elvis-sighteds', `body` = 'Elvis was sighted at the Podunk internet cafe. It looked like he was writing a CodeIgniter apps.', `id_category` = '2'
WHERE `news`.`id` IN ('1')